package ru.geekbrains.java1.dz.dz7.BashtaEvgenii;

import java.util.Random;

public class FabrikaAnimals {
    public static Cat generatorAnimal() {
        Random rnd = new Random();
        Cat animal;
        animal = new Cat();
        String[] names = {"Шабо", "Шаган", "Шагре", "Шаен", "Шайтан", "Шакил", "Шалли", "Шами", "Шани", "Шаник", "Шанити", "Шарж", "Шарик", "Шарко", "Шарли", "Шарль", "Шаро", "Шах", "Шашлык", "Шая", "Шаян", "Шварц", "Швася", "Швепс", "Швондер", "Шедоу", "Шейк", "Шейх", "Шек", "Шелл", "Шельф", "Шенди", "Шени", "Шербур", "Шериф", "Шерлок", "Шерри", "Шерхан", "Шеурен", "Шеф", "Шиги", "Шико", "Шимми", "Ширак", "Ширик", "Шифти", "Шишло", "Шмель", "Шмякс", "Шнапс", "Шнурок", "Шнуря", "Шок", "Шоргус", "Шорти", "Шот", "Шпендрик", "Шпиц", "Шпуня", "Шпуся", "Шрек", "Штранг", "Штрудель", "Шуг", "Шукус", "Шумахер", "Шунгард", "Шунь", "Шуня", "Шустрик", "Шурик", "Шухарт", "Шуша", "Шьен"};
        animal.setName(names[rnd.nextInt((names.length))]);
        return animal;
    }
}
